In [10]:
import pandas as pd

In [11]:
pd.Series([7, 3, 5, 8])

0    7
1    3
2    5
3    8
dtype: int64

In [15]:
x = pd.Series([7, 3, 5, 8], index=['서울', '대구', '부산', '광주'])
print(x)
x['서울']

서울    7
대구    3
부산    5
광주    8
dtype: int64

7

In [16]:
x[['서울', '대구']]

서울    7
대구    3
dtype: int64

In [17]:
x[['대구', '부산', '광주']]

대구    3
부산    5
광주    8
dtype: int64

In [19]:
x.index

Index(['서울', '대구', '부산', '광주'], dtype='object')

In [20]:
x.index[2]

'부산'

In [21]:
x.values

array([7, 3, 5, 8], dtype=int64)

In [22]:
x.values[3]

8

In [23]:
print(sorted(x.index))
print(sorted(x.values))

['광주', '대구', '부산', '서울']
[3, 5, 7, 8]

In [24]:
x.reindex(sorted(x.index))
x

서울    7
대구    3
부산    5
광주    8
dtype: int64

In [25]:
x = pd.Series([3, 8, 5, 9], index=['서울', '대구', '부산', '광주'])
y = pd.Series([2, 4, 5, 1], index=['대구', '부산', '서울', '대전'])
x + y

광주     NaN
대구    10.0
대전     NaN
부산     9.0
서울     8.0
dtype: float64

In [33]:
medal = [1, 3, 2, 4, 2, 3]
x = pd.Series(medal)
print(pd.unique(x))

[1 3 2 4]

In [40]:
medal = ['민준', '현우', '서연', '동현', '서연', '현우']
pdata = pd.Series(medal)
print(pd.unique(pdata))

['민준' '현우' '서연' '동현']

In [41]:
age = {"민준":23, "현우":43, "서연":12, "동현":45}
x = pd.Series(age)
x

민준    23
현우    43
서연    12
동현    45
dtype: int64

In [42]:
a = pdata[3:6]
print(a.values)

['동현' '서연' '현우']

In [43]:
data = {'age' : [23, 43, 12, 45], 
        'name' : ['민준', '현우', '서연', '동현'], 
        'height' : [175.3, 180.3, 165.8, 172.7]}
x = pd.DataFrame(data, columns = ['name', 'age', 'height'])
x

  name  age  height
0   민준   23   175.3
1   현우   43   180.3
2   서연   12   165.8
3   동현   45   172.7

In [44]:
x.name

0    민준
1    현우
2    서연
3    동현
Name: name, dtype: object

In [45]:
ary = [[1, 2],[3, 4], [5, 6]]
data = pd.DataFrame(ary, columns=['First', 'Second'])
data

   First  Second
0      1       2
1      3       4
2      5       6

In [46]:
data.iloc[1]

First     3
Second    4
Name: 1, dtype: int64

In [49]:
data.iloc[:, -1]

0    2
1    4
2    6
Name: Second, dtype: int64

In [52]:
ary = [[1, 2], [3, 4], [5, 6], [7, 8], [9, 10], [11,12]]
data = pd.DataFrame(ary, columns=['First', 'Second'])
data.head(3)

   First  Second
0      1       2
1      3       4
2      5       6

In [53]:
data.tail(3)

   First  Second
3      7       8
4      9      10
5     11      12

In [55]:
ary = [[1, 2], [3, 4], [5, 6], [7, 8], [9, 10]]
data = pd.DataFrame(ary, columns=['First', 'Second'])
bools = [False, True, True, False, True]
data.Second[bools]

1     4
2     6
4    10
Name: Second, dtype: int64

In [56]:
print(x.mean(axis=0))

age        30.750
height    173.525
dtype: float64

In [57]:
data = pd.DataFrame(ary, columns=['수온', '상온'])
data

   수온  상온
0   1   2
1   3   4
2   5   6
3   7   8
4   9  10

In [58]:
data['수온'] =  data['수온'].astype('float')
data

    수온  상온
0  1.0   2
1  3.0   4
2  5.0   6
3  7.0   8
4  9.0  10

In [59]:
food = pd.read_csv('./datafile/food.csv')
food.head()

,Series_reference,Period,Data_value,STATUS,UNITS,Subject,Group,Series_title_1
0,CPIM.SE9S01,1999.06,645,REVISED,Index,Consumers Price Index - CPI,"Food Price Index for New Zealand, Seasonally a...",Seasonally adjusted
1,CPIM.SE9S01,1999.07,647,REVISED,Index,Consumers Price Index - CPI,"Food Price Index for New Zealand, Seasonally a...",Seasonally adjusted
2,CPIM.SE9S01,1999.08,645,REVISED,Index,Consumers Price Index - CPI,"Food Price Index for New Zealand, Seasonally a...",Seasonally adjusted
3,CPIM.SE9S01,1999.09,644,REVISED,Index,Consumers Price Index - CPI,"Food Price Index for New Zealand, Seasonally a...",Seasonally adjusted
4,CPIM.SE9S01,1999.10,641,REVISED,Index,Consumers Price Index - CPI,"Food Price Index for New Zealand, Seasonally a...",Seasonally adjusted

In [61]:
acci = pd.read_csv('./datafile/acci.csv', encoding ='cp949')
acci.head()

          법규위반 주야  발생건수  사망자수   부상자수    중상    경상  부상신고
0           과속  주   159    34    334   140   178    16
1           과속  야   218    73    348   200   139     9
2  교차로 통행방법 위반  주  8817    82  14031  3915  9530   586
3  교차로 통행방법 위반  야  5904    29   9728  2401  6884   443
4           기타  주  9388   141  14070  4271  9217   582